src/Reports/АнализУстойчивостиАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>АнализУстойчивостиАссортимента</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ОграничениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортиментаПодразделения</Name>
			<Comment>Ограничение ассортимента подразделения компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Comment>Товар вводится в базовый ассортимент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>итФорматАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияТовараВАссортименте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияТовараВАссортименте</Name>
			<Comment>Состояния товара в ассортименте подразделения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Введен</Name>
					<Comment>Введен в ассортимент подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выведен</Name>
					<Comment>Выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
					<Comment>Временно выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/АнализУстойчивостиАссортимента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	
Функция ПолучитьДанныеПоДням()
	
	ДатаНачала = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("НачалоПериода",    КомпоновщикНастроек.Настройки);
	ДатаКонца = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("КонецПериода",    КомпоновщикНастроек.Настройки);
	
	тзВыборка = Новый ТаблицаЗначений;
	тзВыборка.Колонки.Добавить("ПодразделениеКомпании");	
	тзВыборка.Колонки.Добавить("ТоварнаяМарка");
	тзВыборка.Колонки.Добавить("ТовараНетНаСкладе");
	тзВыборка.Колонки.Добавить("ТоварЕстьНаСкладе");
	тзВыборка.Колонки.Добавить("КоэффициентУстойчивости");
	тзВыборка.Колонки.Добавить("КоэффициентПрисутствия");
	
	Если ДатаНачала=Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ОстаткиТоваровКомпании.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.Период;
		КонецЕсли; 
	КонецЕсли; 
	Если ДатаКонца=Неопределено Тогда
		ДатаКонца = ТекущаяДата();
	КонецЕсли;
	ДатаПериода = ДатаНачала;
	КоличествоПроверок = 0;
	
	ЗапросПоДням = Новый Запрос;
	ЗапросПоДням.Текст ="ВЫБРАТЬ
	                    |	СУММА(ВЫБОР
	                    |			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход > 0
	                    |				ТОГДА 0
	                    |			ИНАЧЕ 1
	                    |		КОНЕЦ) КАК ТовараНетНаСкладе,
	                    |	МАКСИМУМ(ВЫБОР
	                    |			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход > 0
	                    |				ТОГДА 1
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК ТоварЕстьНаСкладе,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки КАК Ассортимент
	                    |ИЗ
	                    |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&ДатаКон, {(ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Номенклатура).* КАК Номенклатура}) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(Номенклатура).* КАК Номенклатура}) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	                    |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура = ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура
	                    |ГДЕ
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки
	                    |ИТОГИ
	                    |	СУММА(ТовараНетНаСкладе),
	                    |	МАКСИМУМ(ТоварЕстьНаСкладе)
	                    |ПО
	                    |	ПодразделениеКомпании,
	                    |	ТоварнаяМарка,
	                    |	Ассортимент ";

	Пока ДатаПериода<КонецДня(ДатаКонца) Цикл
		ДатаПериодаНач = Новый Граница(НачалоДня(ДатаПериода),ВидГраницы.Включая);
		ДатаПериодаКон = Новый Граница(КонецДня(ДатаПериода),ВидГраницы.Включая);		
		ЗапросПоДням.УстановитьПараметр("ДатаНач", ДатаПериодаНач);
		ЗапросПоДням.УстановитьПараметр("ДатаКон", ДатаПериодаКон);
		
		ВыборкаПоПодразделениям = ЗапросПоДням.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПодразделениеКомпании");
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
			ВыборкаПоТоварнымМаркам = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТоварнаяМарка");
			Пока ВыборкаПоТоварнымМаркам.Следующий() Цикл
				СтруктураОтбора = Новый Структура();
				СтруктураОтбора.Вставить("ПодразделениеКомпании",ВыборкаПоТоварнымМаркам.ПодразделениеКомпании);
				СтруктураОтбора.Вставить("ТоварнаяМарка",ВыборкаПоТоварнымМаркам.ТоварнаяМарка);
				НайденныеСтроки = тзВыборка.НайтиСтроки(СтруктураОтбора);
				
				Если НайденныеСтроки.Количество()=0 Тогда
					СтрокаДанных = тзВыборка.Добавить();
					СтрокаДанных.ПодразделениеКомпании = ВыборкаПоТоварнымМаркам.ПодразделениеКомпании;					
					СтрокаДанных.ТоварнаяМарка = ВыборкаПоТоварнымМаркам.ТоварнаяМарка;
					СтрокаДанных.ТовараНетНаСкладе = ВыборкаПоТоварнымМаркам.ТовараНетНаСкладе;
					СтрокаДанных.ТоварЕстьНаСкладе = ВыборкаПоТоварнымМаркам.ТоварЕстьНаСкладе;
				Иначе 
					СтрокаДанных = НайденныеСтроки[0];
					СтрокаДанных.ТовараНетНаСкладе = СтрокаДанных.ТовараНетНаСкладе + ВыборкаПоТоварнымМаркам.ТовараНетНаСкладе;
					СтрокаДанных.ТоварЕстьНаСкладе = СтрокаДанных.ТоварЕстьНаСкладе + ВыборкаПоТоварнымМаркам.ТоварЕстьНаСкладе;
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
		ДатаПериода = ДатаПериода + 86400;
		КоличествоПроверок = КоличествоПроверок + 1;
	КонецЦикла; 
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	                       |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки) КАК ЗначениеАссортиментаТоварнойМарки
	                       |ИЗ
	                       |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&ДатаКон, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                       |ГДЕ
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании,
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка
	                       |ИТОГИ
	                       |	СУММА(ЗначениеАссортиментаТоварнойМарки)
	                       |ПО
	                       |	ПодразделениеКомпании,
	                       |	ТоварнаяМарка");	
	Запрос.УстановитьПараметр("ДатаКон",Новый Граница(КонецДня(ДатаКонца),ВидГраницы.Включая));
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПодразделениеКомпании");
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		ВыборкаПоТоварнымМаркам = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТоварнаяМарка");
		Пока ВыборкаПоТоварнымМаркам.Следующий() Цикл
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("ПодразделениеКомпании",ВыборкаПоТоварнымМаркам.ПодразделениеКомпании);
			СтруктураОтбора.Вставить("ТоварнаяМарка",ВыборкаПоТоварнымМаркам.ТоварнаяМарка);
			НайденныеСтроки = тзВыборка.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаДанных = НайденныеСтроки[0];
				СтрокаДанных.КоэффициентУстойчивости = 1 - ?(КоличествоПроверок*ВыборкаПоТоварнымМаркам.ЗначениеАссортиментаТоварнойМарки=0,0,(СтрокаДанных.ТовараНетНаСкладе/(КоличествоПроверок*ВыборкаПоТоварнымМаркам.ЗначениеАссортиментаТоварнойМарки)));
				СтрокаДанных.КоэффициентПрисутствия = ?(КоличествоПроверок=0,0,СтрокаДанных.ТоварЕстьНаСкладе/КоличествоПроверок*100);
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	Возврат тзВыборка
	
КонецФункции


	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	ТаблицаРезультат = ПолучитьДанныеПоДням();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРезультат", ТаблицаРезультат);
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ВнешниеНаборыДанных);
	
КонецПроцедуры
#КонецЕсли
